html/cross-ocean.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cross ocean</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">cross ocean</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. links</a></li>
<li><a href="#sec-2">2. salary</a></li>
<li><a href="#sec-3">3. @2015</a></li>
<li><a href="#sec-4">4. @2014</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> links</h2>
<div class="outline-text-2" id="text-1">
<p>
Remote Jobs:
</p>
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs?allowsremote=true">http://careers.stackoverflow.com/jobs?allowsremote=true</a>
</li>
<li><a href="https://weworkremotely.com/">https://weworkremotely.com/</a>
</li>
<li><a href="https://remotecoder.io/">https://remotecoder.io/</a>
</li>
<li><a href="https://www.remotejobsexpert.com/">https://www.remotejobsexpert.com/</a> # 朋友做的网站. 支持!
</li>
</ul>

<p>
Jobs:
</p>
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/">http://careers.stackoverflow.com/jobs/</a>
</li>
<li><a href="http://recruiting.jobvite.com/">http://recruiting.jobvite.com/</a>
</li>
<li><a href="http://www.mercurynews.com/jobs">http://www.mercurynews.com/jobs</a>
</li>
<li><a href="http://www.mitbbs.com/bbsdoc/JobHunting.html">http://www.mitbbs.com/bbsdoc/JobHunting.html</a>
</li>
<li><a href="http://www.glassdoor.com/index.htm">http://www.glassdoor.com/index.htm</a>
</li>
</ul>

<p>
Coding Problem:
</p>
<ul class="org-ul">
<li><a href="cracking-the-coding-interview.html">Cracking The Coding Interview</a>
</li>
<li><a href="http://www.careercup.com/">http://www.careercup.com/</a>
</li>
<li><a href="http://codility.com/">http://codility.com/</a>
</li>
<li><a href="http://leetcode.com/">http://leetcode.com/</a>
</li>
<li><a href="http://community.topcoder.com/">http://community.topcoder.com/</a>
</li>
<li><a href="https://www.geeksforgeeks.org/">https://www.geeksforgeeks.org/</a>
</li>
<li><a href="https://www.topcoder.com/community/data-science/data-science-tutorials/">https://www.topcoder.com/community/data-science/data-science-tutorials/</a>
</li>
<li><a href="https://www.julyedu.com/question/index">https://www.julyedu.com/question/index</a>
</li>
</ul>

<p>
Online Editor:
</p>
<ul class="org-ul">
<li><a href="http://collabedit.com/">http://collabedit.com/</a>
</li>
<li><a href="https://codinghire.com/">https://codinghire.com/</a>
</li>
</ul>

<p>
行为型问题:
</p>
<ul class="org-ul">
<li>So tell me about yourself.
</li>
<li>What is your greatest weakness?
</li>
<li>Have you ever had a conflict with a co-worker? How did you solve it?
</li>
<li>What is your most challenging/interesting project?
</li>
<li>Where do you see yourself in five years?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> salary</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Numbeo - The biggest Internet Database about Cost of Living, Housing Indicators and many other informations about cities and countries! : <a href="http://www.numbeo.com/common/">http://www.numbeo.com/common/</a>
</li>
<li>PayScale - Salary Comparison, Salary Survey, Search Wages : <a href="http://www.payscale.com/">http://www.payscale.com/</a>
</li>
<li>Company Salaries | Glassdoor : <a href="http://www.glassdoor.com/Salaries/index.htm">http://www.glassdoor.com/Salaries/index.htm</a>
</li>
<li>Google Detailed Salary <a href="http://www.valleytalk.org/2014/01/26/google-detailed-salary-information/">http://www.valleytalk.org/2014/01/26/google-detailed-salary-information/</a>
</li>
<li>Microsoft Detailed Salary <a href="http://www.valleytalk.org/2014/02/01/microsoft-h1b-salary-detailed-information/">http://www.valleytalk.org/2014/02/01/microsoft-h1b-salary-detailed-information/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> @2015</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>KickBack Rewards Systems
<ul class="org-ul">
<li><a href="https://remotecoder.io/j/software-developer-c-ems305836">https://remotecoder.io/j/software-developer-c-ems305836</a>
</li>
<li>apply@2015-10-12
</li>
</ul>
</li>

<li>PredictionIO
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/81925/scala-engineer-ml-predictionio">http://careers.stackoverflow.com/jobs/81925/scala-engineer-ml-predictionio</a>
</li>
<li>apply@2015-04-08
</li>
</ul>
</li>

<li>Conduce
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/82498/core-platform-engineer-conduce-inc">http://careers.stackoverflow.com/jobs/82498/core-platform-engineer-conduce-inc</a>
</li>
<li>apply@2015-04-09
</li>
<li>reject@2015-04-09(only for in US)
</li>
</ul>
</li>

<li>DataStax(Cassandra)
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/83662/cassandra-internals-engineer-datastax">http://careers.stackoverflow.com/jobs/83662/cassandra-internals-engineer-datastax</a>
</li>
<li>apply@2015-04-09
</li>
</ul>
</li>

<li>LogZilla
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/84866/c-plus-plus11-python-rock-star-wanted-logzilla-corporation">http://careers.stackoverflow.com/jobs/84866/c-plus-plus11-python-rock-star-wanted-logzilla-corporation</a>
</li>
<li>apply@2015-04-09
</li>
<li>codility@2015-04-09 <a href="https://codility.com/c/feedback/2BS66V-QRJ">https://codility.com/c/feedback/2BS66V-QRJ</a>
</li>
<li>webex@2015-04-15
</li>
<li>offer@2015-04-24
</li>
<li>resign@2015-08-11
</li>
</ul>
</li>

<li>ScalingData
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/78434/infrastructure-engineer-big-data-scalingdata">http://careers.stackoverflow.com/jobs/78434/infrastructure-engineer-big-data-scalingdata</a>
</li>
<li>apply@2015-04-15
</li>
</ul>
</li>

<li>Moz
<ul class="org-ul">
<li><a href="https://jobs.github.com/positions/08aa26ce-50f8-11e5-8877-77916ee106e6">https://jobs.github.com/positions/08aa26ce-50f8-11e5-8877-77916ee106e6</a>
</li>
<li>apply@20150908
</li>
<li>reject@20150909(already have candidates)
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> @2014</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>spoon
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/42334/stream-software-from-the-web-senior-software-spoon-net">http://careers.stackoverflow.com/jobs/42334/stream-software-from-the-web-senior-software-spoon-net</a>
</li>
<li>apply@2013-10-29
</li>
<li><a href="http://careers.stackoverflow.com/jobs/38434/software-engineer-web-and-server-infrastructure-spoon-net">http://careers.stackoverflow.com/jobs/38434/software-engineer-web-and-server-infrastructure-spoon-net</a>
</li>
<li>apply@2013-11-26
</li>
</ul>
</li>

<li>wikimedia
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/40283/software-engineer-data-analytics-back-end-wikimedia-foundation">http://careers.stackoverflow.com/jobs/40283/software-engineer-data-analytics-back-end-wikimedia-foundation</a>
</li>
<li>apply@2013-10-30
</li>
<li>reject@2013-11-08
</li>
</ul>
</li>

<li>codeship
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/43288/senior-software-developer-codership">http://careers.stackoverflow.com/jobs/43288/senior-software-developer-codership</a>
</li>
<li>apply@2013-11-05
</li>
<li>reply@2013-11-23
</li>
<li>skype@2013-12-16
</li>
<li>offer@2013-12-20
</li>
<li>negotiate@2013-12-24
</li>
<li>start@2014-03-03
</li>
<li>resign@2014-12-04
</li>
</ul>
</li>

<li>dropbox
<ul class="org-ul">
<li><a href="https://www.dropbox.com/position?jvi=oNbJVfwm,Job">https://www.dropbox.com/position?jvi=oNbJVfwm,Job</a>
</li>
<li>apply@2013-11-06 <b>(maybe not remote)</b>
</li>
<li>reject@2013-11-13
</li>
</ul>
</li>

<li>parse.ly
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/198">https://weworkremotely.com/jobs/198</a>
</li>
<li>apply@2013-11-08
</li>
</ul>
</li>

<li>duckduckgo
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/196">https://weworkremotely.com/jobs/196</a>
</li>
<li>giveup@2013-11-12 <b>(community based)</b>
</li>
<li><a href="https://duckduckgo.com/">https://duckduckgo.com/</a>
</li>
<li><a href="https://dukgo.com/help/company/hiring">https://dukgo.com/help/company/hiring</a>
</li>
</ul>
</li>

<li>infinipool
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/73">https://weworkremotely.com/jobs/73</a>
</li>
<li>apply@2013-11-12
</li>
<li>reply@2013-11-13
</li>
<li>skype@2013-11-16
</li>
</ul>
</li>

<li>sidebar
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/207">https://weworkremotely.com/jobs/207</a>
</li>
<li>giveup@2013-11-12
</li>
</ul>
</li>

<li>dominoup
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/112">https://weworkremotely.com/jobs/112</a>
</li>
<li>apply@2013-11-11
</li>
</ul>
</li>

<li>aircloak
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/59">https://weworkremotely.com/jobs/59</a>
</li>
<li>apply@2013-11-08
</li>
<li>reject@2013-11-12
</li>
</ul>
</li>

<li>gitlab
<ul class="org-ul">
<li><a href="https://weworkremotely.com/jobs/167">https://weworkremotely.com/jobs/167</a>
</li>
<li>apply@2013-11-16
</li>
<li>reject@2013-11-26
</li>
</ul>
</li>

<li>dataware ventures
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/39501/research-software-developer-dataware-ventures">http://careers.stackoverflow.com/jobs/39501/research-software-developer-dataware-ventures</a>
</li>
<li>giveup@2013-11-21 <b>(At this time, we are only considering US-based remote workers.)</b>
</li>
</ul>
</li>

<li>bayometric
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/43577/senior-java-developer-tech-lead-bayometric">http://careers.stackoverflow.com/jobs/43577/senior-java-developer-tech-lead-bayometric</a>
</li>
<li>giveup@2013-11-21 <b>(maybe not qualified)</b>
</li>
</ul>
</li>

<li>elastic search
<ul class="org-ul">
<li><a href="http://elasticsearch.com/job/distributed-systems-software-engineer/">http://elasticsearch.com/job/distributed-systems-software-engineer/</a>
</li>
</ul>
</li>

<li>box
<ul class="org-ul">
<li><a href="https://www.box.com/about-us/careers/open-positions/?jvi=owjsVfwW,Job">https://www.box.com/about-us/careers/open-positions/?jvi=owjsVfwW,Job</a>
</li>
<li>apply@2013-11-21 <b>(maybe not remote)</b>
</li>
<li><a href="https://www.box.com/about-us/careers/open-positions/?jvi=oWdAXfwq,Job">https://www.box.com/about-us/careers/open-positions/?jvi=oWdAXfwq,Job</a>
</li>
<li>apply@2013-11-21 <b>(maybe not remote)</b>
</li>
<li>reply@2013-11-28
</li>
<li>skype@2013-12-05
</li>
<li>reject@2013-12-05
</li>
</ul>
</li>

<li>scribd
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/43841/systems-engineer-scribd-scribd">http://careers.stackoverflow.com/jobs/43841/systems-engineer-scribd-scribd</a>
</li>
<li><a href="http://www.thesourcery.com/jobs/628">http://www.thesourcery.com/jobs/628</a>
</li>
<li>apply@2013-11-26 <b>(maybe not match)</b>
</li>
<li>giveup@2013-11-26
</li>
<li>reject@2013-12-04
</li>
<li><a href="http://www.thesourcery.com/jobs/611">http://www.thesourcery.com/jobs/611</a>
</li>
<li>apply@2013-11-26 <b>(maybe not remote)</b>
</li>
<li>giveup@2013-11-26
</li>
<li>reject@2013-12-04
</li>
</ul>
</li>

<li>nerd-wallet
<ul class="org-ul">
<li><a href="http://www.thesourcery.com/jobs/650">http://www.thesourcery.com/jobs/650</a>
</li>
<li>apply@2013-11-26 <b>(maybe not remote)</b>
</li>
<li>giveup@2013-11-26
</li>
<li>reply@2013-11-28
</li>
<li>skype@2013-12-03
</li>
<li>reject@2013-12-04
</li>
</ul>
</li>

<li>media-crossing
<ul class="org-ul">
<li><a href="http://careers.stackoverflow.com/jobs/44442/senior-software-engineer-mediacrossing">http://careers.stackoverflow.com/jobs/44442/senior-software-engineer-mediacrossing</a>
</li>
<li>giveup@2013-11-26 <b>(maybe not qualified)</b>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
